rkilchmn/ESP8266_zoomrec/BaseApp.cpp
#include "BaseApp.h"

#include "features.h"
#include <Arduino.h>
#include "iso_date.h"
#include <stdarg.h>
#include <c_types.h>
#include <string.h>
#include <WiFiClientSecure.h>

#ifdef HTTP_OTA
#include <ESP8266HTTPClient.h>
#include <ESP8266httpUpdate.h>
#endif

#ifdef GDB_DEBUG
#include <GDBStub.h>
#endif

// Define the static members
const uint32_t BaseApp::PROBLEMATIC_FLASH_CHIPS[] = {
  0x16400B,  // XTX chips that have issues with deep sleep
  0x184068   // Known Wemos D1 mini pro clone
  // Add more problematic IDs as needed
};

const size_t BaseApp::NUM_PROBLEMATIC_FLASH_CHIPS = 
  sizeof(BaseApp::PROBLEMATIC_FLASH_CHIPS) / sizeof(BaseApp::PROBLEMATIC_FLASH_CHIPS[0]);

BaseApp::BaseApp()
{
    // Client will be initialized when needed
    
    // Identify faulty flash chips that prevent booting after deep sleep
  // https://github.com/esp8266/Arduino/issues/6007#issuecomment-2080368936
  // The XTX chips will return 0B in the last byte, like this: 16400B
  
  // Get the flash chip ID and check if it's problematic
  // Format 0xCCTTMM
  // CC = Capacity Code
  //   14	1 MB (8 Mbit)
  //   15	2 MB (16 Mbit)
  //   16	4 MB (32 Mbit)
  //   17	8 MB (64 Mbit)
  //   18	16 MB (128 Mbit)
  // TT = Memory Type - Typically 0x40, which is common across most standard SPI flash chips
  // MM = Manufacturer ID
  //   EF	Winbond (most common)
  //   C8	GigaDevice
  //   1C	EON/PUYA  
  //   20	Micron
  //   A1	Macronix
  //   0B	XTX (Chinese)
  flashId = ESP.getFlashChipId();

  // Check if the flash ID is in our list of problematic chips
  for (size_t i = 0; i < NUM_PROBLEMATIC_FLASH_CHIPS; i++) {
    if ((flashId & 0xFFFFFF) == (PROBLEMATIC_FLASH_CHIPS[i] & 0xFFFFFF)) {
      deepSleepWorkaround = true;
      break;
    }
  }
}

BaseApp::~BaseApp()
{
#ifdef CONSOLE_TELNET
  if (pBufferedTelnetStream != nullptr)
  {
    delete pBufferedTelnetStream;
  }
#endif

#ifdef CONSOLE_HTTP
  if (pBufferedHTTPRestStream != nullptr)
  {
    delete pBufferedHTTPRestStream;
  }
#endif
}

const char* BaseApp::getMDNSHostname() {
    return "ESP8266-BaseApp";
  }

void BaseApp::AppFirmwareVersion()
{
  FIRMWARE_VERSION = String(__FILE__) + "-" + String(__DATE__) + "-" + String(__TIME__);
}

/* Watchdog to guard against the ESP8266 wasting battery power looking for
 *  non-responsive wifi networks and servers. Expiry of the watchdog will trigger
 *  either a deep sleep cycle or a delayed reboot. The ESP8266 OS has another built-in
 *  watchdog to protect against infinite loops and hangups in user code.
 */

void BaseApp::timeoutCallback()
{
  // This sleep happened because of timeout. Do a restart after a sleep
  console.log(Console::CRITICAL, F("Watchdog timeout...restarting"));
  console.flush();

#ifdef DEEP_SLEEP_SECONDS
  // Enter DeepSleep so that we don't exhaust our batteries by countinuously trying to
  // connect to a network that isn't there.
  deepSleep(DEEP_SLEEP_SECONDS * 1000000, WAKE_RF_DEFAULT);
  // Do nothing while we wait for sleep to overcome us
  while (true)
  {
  };

#else
  delay(1000);
  ESP.restart();
#endif
}

#ifdef LED_STATUS_FLASH
void BaseApp::flash()
{
  digitalWrite(STATUS_LED, !digitalRead(STATUS_LED));
}
#endif

#ifdef WIFI_PORTAL
// Callback for entering config mode
void BaseApp::configModeCallback(WiFiManager *myWiFiManager)
{
  // Config mode has its own timeout
  watchdog.detach();

#ifdef LED_STATUS_FLASH
  flasher.attach(0.2, [this]()
                 { flash(); });
#endif
}
#endif

#ifdef USE_NTP
void BaseApp::setupNtp()
{
  settimeofday_cb([this](boolean from_sntp)
                  { time_is_set(from_sntp); }); // optional: callback if time was sent

  configTime(config.get("timezone_ntp", TZ_Europe_London), NTP_SERVER);

  // Wait for time to be set (with timeout)
  const unsigned long timeout = 30000; // 30 seconds timeout
  const unsigned long start = millis();
   
  while (!ntp_set && (millis() - start < timeout)) {
    delay(100);
    yield(); // Let the ESP8266 handle background tasks
  }
}

void BaseApp::time_is_set(boolean from_sntp /* <= this optional parameter can be used with ESP8266 Core 3.0.0*/)
{
  ntp_set = true;
}

uint32_t BaseApp::sntp_startup_delay_MS_rfc_not_less_than_60000()
{
  randomSeed(A0);
  return random(100);
}

uint32_t BaseApp::sntp_update_delay_MS_rfc_not_less_than_15000()
{
  return 12 * 60 * 60 * 1000UL; // 12 hours
}
#endif

#ifdef USE_MDNS
void BaseApp::setupMDNS() {
  // Start the mDNS responder
  const char* mDNSHostname = getMDNSHostname();
  mDNSHostname = config.get("mDNSHostname", mDNSHostname);
  if (MDNS.begin(mDNSHostname)) {  // Initialize mDNS with the hostname
    console.log(Console::INFO, F("Advertising mDNS with hostname='%s.local'"), mDNSHostname);
  } else {
    console.log(Console::ERROR, F("Advertising mDNS with hostname='%s.local' failed"), mDNSHostname);
  }
}
#endif

#ifdef ARDUINO_OTA
void BaseApp::setupArduinoOta()
{
  // Arduino OTA Initalisation
  int port = config.get("arduino_ota_port", ARDUINO_OTA_PORT);
  ArduinoOTA.setPort(port);
#ifdef USE_MDNS // needs to done again even if MSDN.begin ws already calleed
  const char* mDNSHostname = getMDNSHostname();
  mDNSHostname = config.get("mDNSHostname", mDNSHostname);
  ArduinoOTA.setHostname( mDNSHostname);
#endif

  ArduinoOTA.setPassword(config.get("arduino_ota_password", ARDUINO_OTA_PASSWD));

  ArduinoOTA.onStart([this]()
                     {
      watchdog.detach();
      console.log(Console::INFO, F("OTA upload starting...")); });
  ArduinoOTA.onEnd([this]()
                   { console.log(Console::INFO, F("OTA upload finished")); });
  ArduinoOTA.onProgress([this](unsigned int progress, unsigned int total)
                        { console.log(Console::INFO, F("Progress: %u%%"), (progress / (total / 100))); });
  ArduinoOTA.onError([this](ota_error_t error)
                     {
      console.log(Console::ERROR, F("Error[%u]: "), error);
      if (error == OTA_AUTH_ERROR) console.log(Console::ERROR, F("Auth Failed"));
      else if (error == OTA_BEGIN_ERROR) console.log(Console::ERROR, F("Begin Failed"));
      else if (error == OTA_CONNECT_ERROR) console.log(Console::ERROR, F("Connect Failed"));
      else if (error == OTA_RECEIVE_ERROR) console.log(Console::ERROR, F("Receive Failed"));
      else if (error == OTA_END_ERROR) console.log(Console::ERROR, F("End Failed")); });

  ArduinoOTA.begin();
  console.log(Console::INFO, F("Started Arduino OTA Server on port: %d"), port);
}
#endif

#ifdef HTTP_CONFIG
boolean BaseApp::performHttpConfigUpdate()
{
  String http_config_url = config.get("http_config_url", HTTP_CONFIG_URL);
  if (http_config_url.isEmpty()) {
    console.log(Console::WARNING, F("No HTTP config URL configured"));
    return false;
  }
  
  String http_config_username = config.get("http_config_username", HTTP_CONFIG_USERNAME);
  String http_config_password = config.get("http_config_password", HTTP_CONFIG_PASSWORD);

  console.log(Console::INFO, F("Checking for config update via HTTP from %s"), http_config_url.c_str());

