rkilchmn/ESP8266_zoomrec/BaseApp.cpp
  // Allocate JSON documents for request and response
  DynamicJsonDocument requestHeader(256);  // Headers with version info and last_updated
  DynamicJsonDocument requestBody(0);      // Empty body for GET request
  DynamicJsonDocument responseDoc(Config::JSON_CONFIG_MAXSIZE);
  
  // Add version header
  requestHeader["x-ESP8266-version"] = FIRMWARE_VERSION;
  requestHeader["x-ESP8266-config-version"] = config.get("version", "");

  int httpCode = JSONAPIClient::performRequest(
    *client,
    JSONAPIClient::HTTP_METHOD_GET,
    http_config_url.c_str(),
    "",
    requestHeader,
    requestBody,
    responseDoc,
    http_config_username.c_str(),
    http_config_password.c_str()
  );

  switch (httpCode) {
    case HTTP_CODE_OK:
      // Save the configuration
      if (config.saveConfig(responseDoc)) {
        console.log(Console::INFO, F("Successfully updated config via HTTP from %s"), http_config_url.c_str());
        return true;
      } else {
        console.log(Console::ERROR, F("Failed to save config"));
        return false;
      }
      break;
    case HTTP_CODE_NOT_MODIFIED:
    case HTTP_CODE_NO_CONTENT:
      console.log(Console::INFO, F("No Config Update available via HTTP"));
      return true;
      break;
    default:
      console.log(Console::ERROR, F("HTTP request %s failed with code: %d"), http_config_url.c_str(), httpCode);
      if (responseDoc.containsKey("message")) {
        console.log(Console::ERROR, F("message: %s"), responseDoc["message"].as<String>().c_str());
      }
      return false;
      break;
  }
}
#endif // HTTP_CONFIG

#ifdef HTTP_OTA
boolean BaseApp::performHttpOtaUpdate()
{
  String http_ota_url = config.get("http_ota_url", HTTP_OTA_URL);
  if (http_ota_url.isEmpty()) {
    console.log(Console::WARNING, F("No HTTP OTA URL configured"));
    return false;
  }

  String http_ota_username = config.get("http_ota_username", HTTP_OTA_USERNAME);
  String http_ota_password = config.get("http_ota_password", HTTP_OTA_PASSWORD);

  console.log(Console::INFO, F("Checking for firmware update via HTTP from %s"), http_ota_url.c_str());
  
  // Set up HTTP update
  ESPhttpUpdate.rebootOnUpdate(true);
  
  // Set LED pin for status if configured
  #ifdef LED_STATUS_FLASH
    ESPhttpUpdate.setLedPin(STATUS_LED, LED_ON);
  #endif
  
  // Set authorization if credentials are provided
  if (!http_ota_username.isEmpty() && !http_ota_password.isEmpty()) {
    ESPhttpUpdate.setAuthorization(http_ota_username, http_ota_password);
  }

  // Detach watchdog to prevent timeouts during update
  watchdog.detach();

  // http update needs a much longer timeout
  int prev_timeout = client->getTimeout();
  client->setTimeout(5 * 60 * 1000); // timeout after x minutes
  
  // Start the update
  t_httpUpdate_return ret = ESPhttpUpdate.update(*client, http_ota_url, FIRMWARE_VERSION);

  // Restore previous timeout
  client->setTimeout(prev_timeout);
  
  // Handle the result
  switch (ret) {
    case HTTP_UPDATE_FAILED:
      console.log(Console::ERROR, F("Firmware update failed: %s"), 
                ESPhttpUpdate.getLastErrorString().c_str());
      return false;
      
    case HTTP_UPDATE_NO_UPDATES:
      console.log(Console::INFO, F("No firmware update available"));
      return false;
      
    case HTTP_UPDATE_OK:
      console.log(Console::INFO, F("Firmware update successful"));
      return true;
      
    default:
      console.log(Console::ERROR, F("Unknown firmware update status: %d"), ret);
      return false;
  }
}
#endif

boolean BaseApp::connectWiFi()
{
#ifdef LED_STATUS_FLASH
  pinMode(STATUS_LED, OUTPUT);
  flasher.attach(0.6, [this]()
                 { flash(); });
#endif

  // Watchdog timer - resets if setup takes longer than allocated time
  watchdog.once(WATCHDOG_SETUP_SECONDS, [this]()
                { timeoutCallback(); });

  // try connect using previous connection details stored in eeprom
  if (WiFi.SSID().length() > 0)
  {
    // Print the SSID and password
    console.log(Console::INFO, F("WiFi credentials stored: %s"), WiFi.SSID().c_str());

    console.log(Console::INFO, F("Connecting..."));

    WiFi.begin(WiFi.SSID(), WiFi.psk());
    WiFi.waitForConnectResult(FAST_CONNECTION_TIMEOUT);
  }

#ifdef WPS_CONFIG
  if (WiFi.status() != WL_CONNECTED)
  {
    console.log(Console::INFO, F("Starting WPS configuration..."));
    WiFi.beginWPSConfig();

    if (WiFi.SSID().length() > 0)
    {
      // Print the SSID and password
      console.printf("WPS credentials received: %s", WiFi.SSID().c_str());

      WiFi.begin(WiFi.SSID(), WiFi.psk());
      WiFi.persistent(true);
      WiFi.setAutoConnect(true);
      WiFi.setAutoReconnect(true);
      if (WiFi.waitForConnectResult() != WL_CONNECTED)
      {
        console.log(Console::WARNING, F("Connecting using WPS timed out!"));
        timeoutCallback();
      }
    }
  }
#endif

  // Set up WiFi connection using portal
  if (WiFi.status() != WL_CONNECTED)
  {
#ifdef WIFI_PORTAL
#ifdef WIFI_PORTAL_TRIGGER_PIN
    pinMode(WIFI_PORTAL_TRIGGER_PIN, INPUT_PULLUP);
    delay(100);
    if (digitalRead(WIFI_PORTAL_TRIGGER_PIN) == LOW)
    {
      watchdog.detach();
      if (!wifiManager.startConfigPortal(SSID, NULL))
      {
        console.log(Console::ERROR, F("Starting WiFi Config Portal Failed!"));
        timeout_cb();
      }
    }
    else
    {
#endif

      // for debugging
      wifiManager.setDebugOutput(true);

      wifiManager.setConfigPortalTimeout(180);
      wifiManager.setAPCallback([this](WiFiManager *myWiFiManager)
                                { configModeCallback(myWiFiManager); });
      if (!wifiManager.autoConnect())
      {
        console.log(Console::WARNING, F("Connection Failed!"));
        timeoutCallback();
      }

#ifdef WIFI_PORTAL_TRIGGER_PIN
    }
#endif

#else
    // Save boot up time by not configuring them if they haven't changed
    if (WiFi.SSID() != WIFI_SSID)
    {
      console.log(Console::INFO, F("Initialising Wifi..."));
      WiFi.mode(WIFI_STA);
      WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
      WiFi.persistent(true);
      WiFi.setAutoConnect(true);
      WiFi.setAutoReconnect(true);
    }
#endif
  }

