rkilchmn/ESP8266_zoomrec/BaseApp.cpp
  if (WiFi.waitForConnectResult() != WL_CONNECTED)
  {
    console.log(Console::WARNING, F("Connection Finally Failed!"));
    timeoutCallback();
  }

#ifdef LED_STATUS_FLASH
  flasher.detach();
  digitalWrite(STATUS_LED, LED_OFF);
#endif

  if (WiFi.status() == WL_CONNECTED)
  {
    // we have internet connection
    console.log(Console::INFO, F("IP address: %s"), WiFi.localIP().toString().c_str());
    return true;
  }
  else
    return false;
}

String BaseApp::getResetReasonString(uint8_t reason)
{
  switch (reason)
  {
  case REASON_DEFAULT_RST:
    return "Power-on reset";
  case REASON_WDT_RST:
    return "Watchdog reset";
  case REASON_EXCEPTION_RST:
    return "Exception reset";
  case REASON_SOFT_WDT_RST:
    return "Software Watchdog reset";
  case REASON_SOFT_RESTART:
    return "Software restart";
  case REASON_DEEP_SLEEP_AWAKE:
    return "Deep sleep wake-up";
  case REASON_EXT_SYS_RST:
    return "External system reset";
  default:
    return "Unknown reset reason";
  }
}

// Put any project specific code here
const int INPUTPINRESETSWITCH = D1;
const int outputPinPowerButton = D2;
int lastStatus = LOW;

void BaseApp::setup()
{
  // try to initialize with baud rate from config
  int serial_baud = config.get("serial_baud", SERIAL_DEFAULT_BAUD);
  console.begin(serial_baud);

   // determine logLevel
   int logLevel = config.get("log_level", Console::DEBUG);
   console.setLogLevel(console.intToLogLevel(logLevel));
   // set log time format
   if (config.exists("log_time_format")) {
     console.setTimeFormat(config.get("log_time_format", ""));
   }

  console.println(); // newline after garbage from startup

#ifdef GDB_DEBUG
  console.log(Console::INFO, F("GDB Debug enabled"));
  gdbstub_init();
#endif

  // setup for deep sleep
  pinMode(D0, WAKEUP_PULLUP); // be carefull when using D0 and using deep sleep
  int deep_sleep_option = config.get("deep_sleep_option", WAKE_RFCAL);
  system_deep_sleep_set_option(deep_sleep_option);

  // connect to WIFI depending on what connection features are enabled
  connectWiFi();

#ifdef USE_NTP
  setupNtp();
#endif

  // Set up the client based on configuration
  // IMPORTANT: if root certificate is used NTP time must be set to check cert validity 

  if (!setupClient()) {
    console.log(Console::ERROR, F("Failed to set up HTTP client"));
    // Don't return false since setup() is void
  }

#ifdef CONSOLE_TELNET
  int port = config.get("telnet_port", TELNET_DEFAULT_PORT);
  console.log(Console::INFO, F("Telnet service started on port: %d"), port);
  pBufferedTelnetStream = new TelnetStreamBuffered(port);
  pBufferedTelnetStream->begin(port);
  console.begin(*pBufferedTelnetStream, Serial); // continue output to Serial
#else
#ifdef CONSOLE_HTTP
  // int port = config.get("telnet_port", TELNET_DEFAULT_PORT);
  // console.log(Console::INFO, F("Telnet service started on port: %d"), port);
  const char *http_log_url = config.get("http_log_url");
  if (!strlen(http_log_url))
  { // empty
    console.log(Console::ERROR, F("Missing configuration for 'http_log_url'. HTTP logging not started."));
  }
  else
  {
    pBufferedHTTPRestStream = new HttpStreamBuffered(
      *client,
      config.get("http_log_id", FIRMWARE_VERSION.c_str()), 
      http_log_url, "",
      config.get("http_log_username"),
      config.get("http_log_password")
    );
    console.log(Console::INFO, F("Starting HTTP logging to %s."), http_log_url);
    console.begin(*pBufferedHTTPRestStream, Serial);
  }
#endif
#endif

  AppFirmwareVersion();
  console.log(Console::INFO, F("Current firmware version: '%s'"), (FIRMWARE_VERSION).c_str());
  logEnabledFeatures();

  console.log(Console::INFO, F("Flash ID: 0x%06X, Deep Sleep Workaround: %s"), 
            (flashId & 0xFFFFFF), 
            deepSleepWorkaround ? "Enabled" : "Disabled");

  console.log(Console::DEBUG, F("Start of initialization: Reset Reason='%s'"), getResetReasonString(ESP.getResetInfoPtr()->reason).c_str());

  // Print config
  config.print(&console);

#ifdef USE_MDNS
  setupMDNS();
#endif

#ifdef ARDUINO_OTA
  setupArduinoOta();
#endif

#ifdef JSON_CONFIG_OTA
  config.setupOtaServer(&console);
#endif

#ifdef HTTP_CONFIG
  performHttpConfigUpdate();
#endif  

#ifdef HTTP_OTA
  performHttpOtaUpdate();
#endif

#ifdef DEEP_SLEEP_SECONDS
  if (!deepSleepState.loadFromRTC())
  {
    console.log(Console::DEBUG, F("DeepSleepState cold boot - calling appDeepSleepStateInit for state initialization."));
    AppDeepSleepStateInit();
  }
#endif

  // individual setup for apps
  AppSetup();

  console.log(Console::DEBUG, F("End of initialization"));
  watchdog.detach();
}

void BaseApp::AppSetup()
{
  // override this method if required
}

void BaseApp::AppLoop()
{
  // override this method if required
}

void BaseApp::AppIntervall()
{
  // override this method if required
}

void BaseApp::AppDeepSleepStateInit()
{
  // override this method if required
}

void BaseApp::AppNTPSet()
{
  // override this method if you need to perform actions after NTP time is first set
}

void BaseApp::loop()
{

#ifdef USE_MDNS
  // Handle mDNS requests
  MDNS.update();  // Keep the mDNS responder active
#endif

#ifdef JSON_CONFIG_OTA
  // Handle HTTP requests
  config.handleOTAServerClient();
#endif

#ifdef ARDUINO_OTA
  // Handle any OTA upgrade
  ArduinoOTA.handle();
#endif

// #ifdef USE_NTP
//   // Call AppNTPSet once after NTP time is first set
//   if (ntp_set && ntp_first) {
//     ntp_first = false;
//     AppNTPSet();
//   }
// #endif

  // Watchdog timer - resets if setup takes longer than allocated time
  watchdog.once(WATCHDOG_LOOP_SECONDS, [this]()
                { timeoutCallback(); });

#ifdef TIMER_INTERVAL_MILLIS
  // https://www.norwegiancreations.com/2018/10/arduino-tutorial-avoiding-the-overflow-issue-when-using-millis-and-micros/
  if ((unsigned long)(millis() - timer_interval) > TIMER_INTERVAL_MILLIS)
  {
    timer_interval = millis();
    AppIntervall();
  }
#endif

  AppLoop();

  watchdog.detach();

#ifdef DEEP_SLEEP_SECONDS

