rkilchmn/ESP8266_zoomrec/BaseApp.cpp
  // no deep sleep after normal power up to allow for OTA updates
  bool expired = false;
  if ((unsigned long)(millis() - timer_coldboot) > DEEP_SLEEP_STARTUP_SECONDS * 1000)
  {
    timer_coldboot = millis();
    expired = true;
  }

  if ((ESP.getResetInfoPtr()->reason == REASON_DEEP_SLEEP_AWAKE) || expired)
  {
    if (preventDeepSleep)
      console.log(Console::DEBUG, F("Prevented from deep sleep: preventDeepSleep=%d"), preventDeepSleep);
    else
    {
      // Enter DeepSleep
      deepSleepState.saveToRTC();
      console.log(Console::INFO, F("Entering deep sleep for %d seconds..."), DEEP_SLEEP_SECONDS);
      console.flush();
      digitalWrite(STATUS_LED, HIGH);
      deepSleep(DEEP_SLEEP_SECONDS * 1000000);
      // Do nothing while we wait for sleep to overcome us
      while (true)
      {
      }
    }
  }
#endif
}

bool BaseApp::setupClient() {
  // Hardcoded PEM public key stored in RAM (avoid PROGMEM for BearSSL)
//   static const char pubkeyPem[] = R"KEY(
// -----BEGIN PUBLIC KEY-----
// MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAE38HxSo9LBaFlVRhtsdFhfY5+qwfH
// d5ZA4aTcf+MEQcHF/YiHuH7YIxn39JuV4+b/rOhlwbi2/Bostz/ll5ZGMg==
// -----END PUBLIC KEY-----
// )KEY";

//   static const char rootKeyPem[] = R"KEY(
// -----BEGIN CERTIFICATE-----
// MIIFazCCA1OgAwIBAgIRAIIQz7DSQONZRGPgu2OCiwAwDQYJKoZIhvcNAQELBQAw
// TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh
// cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMTUwNjA0MTEwNDM4
// WhcNMzUwNjA0MTEwNDM4WjBPMQswCQYDVQQGEwJVUzEpMCcGA1UEChMgSW50ZXJu
// ZXQgU2VjdXJpdHkgUmVzZWFyY2ggR3JvdXAxFTATBgNVBAMTDElTUkcgUm9vdCBY
// MTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAK3oJHP0FDfzm54rVygc
// h77ct984kIxuPOZXoHj3dcKi/vVqbvYATyjb3miGbESTtrFj/RQSa78f0uoxmyF+
// 0TM8ukj13Xnfs7j/EvEhmkvBioZxaUpmZmyPfjxwv60pIgbz5MDmgK7iS4+3mX6U
// A5/TR5d8mUgjU+g4rk8Kb4Mu0UlXjIB0ttov0DiNewNwIRt18jA8+o+u3dpjq+sW
// T8KOEUt+zwvo/7V3LvSye0rgTBIlDHCNAymg4VMk7BPZ7hm/ELNKjD+Jo2FR3qyH
// B5T0Y3HsLuJvW5iB4YlcNHlsdu87kGJ55tukmi8mxdAQ4Q7e2RCOFvu396j3x+UC
// B5iPNgiV5+I3lg02dZ77DnKxHZu8A/lJBdiB3QW0KtZB6awBdpUKD9jf1b0SHzUv
// KBds0pjBqAlkd25HN7rOrFleaJ1/ctaJxQZBKT5ZPt0m9STJEadao0xAH0ahmbWn
// OlFuhjuefXKnEgV4We0+UXgVCwOPjdAvBbI+e0ocS3MFEvzG6uBQE3xDk3SzynTn
// jh8BCNAw1FtxNrQHusEwMFxIt4I7mKZ9YIqioymCzLq9gwQbooMDQaHWBfEbwrbw
// qHyGO0aoSCqI3Haadr8faqU9GY/rOPNk3sgrDQoo//fb4hVC1CLQJ13hef4Y53CI
// rU7m2Ys6xt0nUW7/vGT1M0NPAgMBAAGjQjBAMA4GA1UdDwEB/wQEAwIBBjAPBgNV
// HRMBAf8EBTADAQH/MB0GA1UdDgQWBBR5tFnme7bl5AFzgAiIyBpY9umbbjANBgkq
// hkiG9w0BAQsFAAOCAgEAVR9YqbyyqFDQDLHYGmkgJykIrGF1XIpu+ILlaS/V9lZL
// ubhzEFnTIZd+50xx+7LSYK05qAvqFyFWhfFQDlnrzuBZ6brJFe+GnY+EgPbk6ZGQ
// 3BebYhtF8GaV0nxvwuo77x/Py9auJ/GpsMiu/X1+mvoiBOv/2X/qkSsisRcOj/KK
// NFtY2PwByVS5uCbMiogziUwthDyC3+6WVwW6LLv3xLfHTjuCvjHIInNzktHCgKQ5
// ORAzI4JMPJ+GslWYHb4phowim57iaztXOoJwTdwJx4nLCgdNbOhdjsnvzqvHu7Ur
// TkXWStAmzOVyyghqpZXjFaH3pO3JLF+l+/+sKAIuvtd7u+Nxe5AW0wdeRlN8NwdC
// jNPElpzVmbUq4JUagEiuTDkHzsxHpFKVK7q4+63SM1N95R1NbdWhscdCb+ZAJzVc
// oyi3B43njTOQ5yOf+1CceWxG1bQVs5ZufpsMljq4Ui0/1lvh+wjChP4kqKOJ2qxq
// 4RgqsahDYVvTH9w7jXbyLeiNdd8XM2w9U/t7y0Ff/9yi0GE44Za4rF2LN9d11TPA
// mRGunUHBcnWEvgJBQl9nJEiU0Zsnvgc/ubhPgXRR4Xq37Z0j4r7g1SgEEzwxA57d
// emyPxgcYxn/eR44/KJ4EBs+lVDR3veyJm+kXQ99b21/+jh5Xos1AnX5iItreGCc=
// -----END CERTIFICATE-----
// // )KEY";

  // Create the secure client first
  BearSSL::WiFiClientSecure* secureClient = new BearSSL::WiFiClientSecure();
  if (!secureClient) {
    Serial.println(F("BaseApp: Failed to create WiFiClientSecure"));
    return false;
  }

  // Get public key from configuration
  const char* pubkeyPem = config.get("tls_server_pubkey", "");
  if (strlen(pubkeyPem) == 0) {
    Serial.println(F("BaseApp: No TLS server public key found in configuration (tls_server_pubkey)"));
    return false;
  }
  
  // Create and set the public key
  serverPubKey = std::unique_ptr<BearSSL::PublicKey>(new BearSSL::PublicKey(pubkeyPem));
  if (!serverPubKey) {
    Serial.println(F("Failed to create PublicKey from configuration"));
    delete secureClient;
    return false;
  }
  
  secureClient->setKnownKey(serverPubKey.get());
  secureClient->allowSelfSignedCerts();
  
  // Minimize buffer usage
  secureClient->setBufferSizes(512, 512);
  
  // Set minimum security level (adjust as needed)
  // secureClient->setInsecure();  // Keep this if you want to allow self-signed certs
  
  // Wrap the raw pointer into the unique_ptr<WiFiClient> member
  client = std::unique_ptr<WiFiClient>(secureClient);
  
  return client != nullptr;
}

// Function to log enabled features
void BaseApp::logEnabledFeatures() {
    // Check and log each 
    #ifdef WIFI_PORTAL
    console.log(Console::INFO, F("Feature Enabled: WiFi Configuration Portal"));
    #endif

    #ifdef WPS_CONFIG
    console.log(Console::INFO, F("Feature Enabled: WPS Configuration"));
    #endif

    #ifdef ARDUINO_OTA
    console.log(Console::INFO, F("Feature Enabled: Arduino OTA Updates"));
    #endif

    #ifdef HTTP_OTA
    console.log(Console::INFO, F("Feature Enabled: HTTP OTA Updates"));
    #endif

    #ifdef HTTP_CONFIG
    console.log(Console::INFO, F("Feature Enabled: HTTP Config Updates"));
    #endif

    #ifdef LED_STATUS_FLASH
    console.log(Console::INFO, F("Feature Enabled: LED Status Flash"));
    #endif

    #ifdef DEEP_SLEEP_SECONDS
    console.log(Console::INFO, F("Feature Enabled: Deep Sleep Mode (Seconds: %d, Startup Seconds: %d)"), DEEP_SLEEP_SECONDS, DEEP_SLEEP_STARTUP_SECONDS);
    #endif

    #ifdef JSON_CONFIG_OTA
    console.log(Console::INFO, F("Feature Enabled: JSON Configuration OTA"));
    #endif

    #ifdef GDB_DEBUG
    console.log(Console::INFO, F("Feature Enabled: GDB Debugging"));
    #endif

    #ifdef USE_NTP
    console.log(Console::INFO, F("Feature Enabled: NTP (Network Time Protocol)"));
    #endif

    #ifdef USE_MDNS
    console.log(Console::INFO, F("Feature Enabled: mDNS (Local Network Hostname Resolution)"));
    #endif

    #ifdef TIMER_INTERVAL_MILLIS
    console.log(Console::INFO, F("Feature Enabled: Timer Interval Execution (ms: %d)"), TIMER_INTERVAL_MILLIS);
    #endif

    #ifdef CONSOLE_TELNET
    console.log(Console::INFO, F("Feature Enabled: Telnet Console Output"));
    #endif

    #ifdef CONSOLE_HTTP
    console.log(Console::INFO, F("Feature Enabled: HTTP Console Output"));
    #endif
}

