rkilchmn/ESP8266_zoomrec/BaseApp.cpp
/*
alternate deep sleep function to overcome "zombie" boot stopping after "ets Jan 8 2013,rst cause:2, boot mode:(3,6)"
Code is from https://github.com/esp8266/Arduino/issues/6318#issuecomment-2571455549
it is an improvement over https://github.com/esp8266/Arduino/issues/6318#issuecomment-2238811311
1) the sleep time is exact 
2) serial is prperly flushed before deepsleep (other serial messages originated before deepsleep show after wakeup)

see also https://github.com/esp8266/Arduino/issues/6007 
other possible solution  https://github.com/NickHrach/LongDeepSleep
*/
static uint32 *rtc = (uint32 *)0x60000700;

void BaseApp::deepSleepNK(uint32 time_us)
{
  rtc[0] = 0x30;
  rtc[1] = rtc[7] + 5;
  rtc[3] = 0x10010;
  rtc[4] = 0;
  rtc[6] = 8;
  rtc[17] = 4;
  rtc[2] = 1 << 20;
  ets_delay_us(10);
  rtc[0] &= 0xFCF;
  rtc[0] = 0;
  rtc[1] = rtc[7] + (45 * (time_us >> 8));
  rtc[3] = 0x640C8;
  rtc[6] = 0x18;
  rtc[16] = 0x7F;
  rtc[17] = 0x20;
  rtc[39] = 0x11;
  rtc[40] = 0x03;
  rtc[2] = 1 << 20;
  __asm volatile("waiti 0");
}

void BaseApp::deepSleep(uint32_t time_us, RFMode mode) {
    if (deepSleepWorkaround) {
        // For the workaround, we need to set the deep sleep option manually
        system_deep_sleep_set_option(mode);
        // Use the workaround method for problematic flash chips
        console.log(Console::DEBUG, F("Using deep sleep workaround for this zombie flash chip for %d us with RF mode %d"), time_us, mode);
        deepSleepNK(time_us);
    } else {
        // Use standard deep sleep for known good chips
        console.log(Console::DEBUG, F("Using deep sleep for %d us with RF mode %d"), time_us, mode);
        ESP.deepSleep(time_us, mode);
    }
}